In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [3]:
df1 = pd.read_csv("data.csv")
df1.head()

,id,price_tnd,price_eur,location,city,governorate,Area,pieces,room,bathroom,...,garden,concierge,beach_view,mountain_view,pool,elevator,furnished,equipped_kitchen,central_heating,air_conditioning
0,b9e1c759-d149-46e8-9765-d8c198a13ff0,NaN,NaN,Cité El Bassatine Ancien,Boumhel Bassatine,Ben Arous,NaN,27.0,8.0,NaN,...,0,0,0,0,0,0,0,0,0,0
1,863e62e5-0bfe-49f3-ad97-e0ae91be68e9,3250000.0,1007500.0,El Kantaoui,Hammam Sousse,Sousse,1000.0,26.0,16.0,14.0,...,0,1,1,0,0,1,1,1,1,1
2,0048e6da-9aec-4ebe-8ee1-1ad7cd0015e6,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1
3,032f818f-1b38-4d1a-a000-753e235ccf54,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,NaN,...,0,0,0,0,0,0,1,1,1,1
4,2272576f-fb3b-4c82-8a0e-a00fe2e7c154,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1

In [4]:
df1.shape

(8129, 26)

In [5]:
df1.groupby('location')['location'].agg('count')

location
Abou El Kacem Chebbi      4
Aghir                    12
Ain Zaghouan Nord       144
Ain Zaghouan Sud         24
Ajim                      2
                       ...
Zaouit Mornag             1
Zarzis                    5
Zarzouna                  5
Zone Touristique         26
Zone touristique          3
Name: location, Length: 468, dtype: int64

In [6]:
df2 = df1.drop(['pool','elevator','furnished','governorate', 'price_tnd', 'city', 'latt', 'long', 'concierge', 'garden', 'pieces', 'id', 'elevator','air_conditioning', 'equipped_kitchen', 'furnished'], axis='columns')
df2.head()

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating
0,NaN,Cité El Bassatine Ancien,NaN,8.0,NaN,NaN,NaN,30.815266,0,0,0,0
1,1007500.0,El Kantaoui,1000.0,16.0,14.0,30-50,1.0,108.792932,1,1,0,1
2,620000.0,Sousse Corniche,932.0,24.0,10.0,NaN,1.0,118.317747,0,0,0,1
3,620000.0,Sousse Corniche,932.0,24.0,NaN,NaN,NaN,118.316886,0,0,0,1
4,620000.0,Sousse Corniche,932.0,24.0,10.0,NaN,1.0,118.316886,0,0,0,1

In [7]:
df2.isnull().sum()

price_eur              1708
location                  0
Area                    185
room                    409
bathroom                659
age                    4145
state                  1100
distance_to_capital      35
garage                    0
beach_view                0
mountain_view             0
central_heating           0
dtype: int64

In [8]:
df3 = df2.dropna()
df3.isnull().sum()

price_eur              0
location               0
Area                   0
room                   0
bathroom               0
age                    0
state                  0
distance_to_capital    0
garage                 0
beach_view             0
mountain_view          0
central_heating        0
dtype: int64

In [9]:
df3.shape

(2972, 12)

In [10]:
df3.head()

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating
1,1007500.0,El Kantaoui,1000.0,16.0,14.0,30-50,1.0,108.792932,1,1,0,1
5,310000.0,Sousse Riadh,1000.0,16.0,9.0,1-5,2.0,119.603211,1,0,0,0
10,620000.0,Kélibia,462.0,12.0,13.0,1-5,2.0,14.249053,0,1,0,1
11,372000.0,Bou Mhel,510.0,14.0,4.0,5-10,1.0,30.815266,1,0,1,1
16,294500.0,El Gourjani,538.0,16.0,5.0,30-50,1.0,2.191132,0,0,0,0

In [12]:
df3.Area.unique()

array([ 1000.,   462.,   510.,   538.,   400.,   220.,   800.,   750.,
         600.,   630.,   460.,   700.,   500.,   420.,   350.,   300.,
        2000.,  1900.,  1187.,   980.,   760.,   550.,   515.,   385.,
         120.,  6800.,  4000.,   900.,   865.,   780.,   761.,   652.,
         480.,   446.,   360.,   266.,   265.,   262.,   222.,   150.,
        1200.,   680.,   463.,   444.,   416.,   410.,   320.,   200.,
         161., 10000.,  6000.,  2700.,  1370.,  1300.,  1021.,   966.,
         960.,   790.,   650.,   504.,   454.,   451.,   380.,   318.,
         295.,   270.,   240.,   206.,   178.,   124., 12000.,  1330.,
        1104.,   670.,   667.,   660.,   613.,   578.,   495.,   485.,
         483.,   470.,   458.,   440.,   412.,   330.,   280.,   164.,
         143., 18000.,  2058.,  1350.,  1311.,  1180.,  1152.,  1120.,
        1080.,  1040.,   886.,   858.,   840.,   833.,   806.,   801.,
         730.,   705.,   675.,   628.,   577.,   570.,   540.,   453.,
         450.,   443.,   430.,   417.,   415.,   404.,   392.,   363.,
         325.,   308.,   278.,   260.,   252.,   250.,   234.,   230.,
         218.,   183.,   170.,   142.,   100.,  2300.,   990.,   830.,
         770.,   720.,   710.,   703.,   658.,   623.,   605.,   596.,
         592.,   590.,   584.,   580.,   527.,   506.,   490.,   486.,
         481.,   465.,   457.,   445.,   411.,   407.,   402.,   388.,
         377.,   365.,   362.,   290.,   267.,   237.,   214.,   207.,
         185.,   180.,   167.,   160.,   156.,   153.,   145.,   110.,
          80.,  1756.,  1500.,  1250.,  1210.,   936.,   921.,   878.,
         747.,   737.,   704.,   702.,   682.,   674.,   621.,   614.,
         611.,   610.,   593.,   587.,   585.,   546.,   541.,   534.,
         530.,   519.,   487.,   475.,   472.,   468.,   456.,   455.,
         448.,   442.,   408.,   386.,   370.,   357.,   340.,   323.,
         317.,   315.,   291.,   277.,   273.,   271.,   269.,   261.,
         248.,   235.,   232.,   225.,   224.,   221.,   219.,   210.,
         209.,   205.,   190.,   188.,   177.,   175.,   165.,   140.,
         138.,   135.,   133.,   119.,   105.,   103.,    77.,   505.,
       10746.,  3000.,  2800.,  2552.,  2500.,  1720.,  1680.,  1420.,
        1400.,  1326.,  1287.,  1280.,  1100.,  1015.,   950.,   935.,
         920.,   913.,   910.,   898.,   860.,   853.,   850.,   845.,
         755.,   745.,   668.,   663.,   645.,   635.,   634.,   625.,
         620.,   616.,   599.,   579.,   569.,   554.,   543.,   536.,
         532.,   524.,   518.,   512.,   469.,   452.,   441.,   436.,
         431.,   426.,   425.,   398.,   390.,   384.,   379.,   378.,
         376.,   372.,   369.,   366.,   345.,   338.,   335.,   331.,
         327.,   310.,   297.,   294.,   287.,   285.,   284.,   283.,
         275.,   264.,   263.,   259.,   258.,   246.,   245.,   239.,
         236.,   233.,   227.,   226.,   215.,   213.,   208.,   204.,
         203.,   202.,   196.,   187.,   182.,   181.,   179.,   173.,
         172.,   171.,   166.,   163.,   162.,   159.,   157.,   155.,
         149.,   148.,   146.,   139.,   136.,   132.,   130.,   126.,
         125.,   115.,   112.,   111.,   109.,   108.,    97.,    90.,
          88.,    87.,    86.,    60., 10300.,  9972.,  8659.,  4600.,
        2491.,  1850.,  1450.,   870.,   817.,   734.,   714.,   612.,
         533.,   522.,   521.,   498.,   497.,   478.,   476.,   419.,
         413.,   368.,   367.,   364.,   352.,   343.,   328.,   326.,
         316.,   312.,   311.,   303.,   301.,   298.,   289.,   288.,
         286.,   274.,   256.,   244.,   243.,   242.,   228.,   216.,
         212.,   198.,   197.,   195.,   194.,   193.,   192.,   191.,
         189.,   186.,   174.,   169.,   168.,   158.,   154.,   152.,
         151.,   147.,   144.,   141.,   137.,   134.,   131.,   129.,
         128.,   127.,   122.,   118.,   117.,   116.,   114.,   113.,
         107.,   106.,   102.,   101.,    99.,    98.,    95.,    93.,
          91.,    85.,    82.,    81.,    75.,    74.,    70.,    64.,
          62.,    58.,    46.,  7765.,  6745.,  1003.,   882.,   517.,
         471.,   433.,   424.,   394.,   344.,   333.,   305.,   247.,
         184.,   123.,   104.,    96.,    94.,    92.,    84.,    78.,
          76.,    73.,    69.,    68.,    67.,    66.,    65.,    52.,
          50.,    45., 20000.,  2431.,  1248.,   648.,   319.,   254.,
         121.,    89.,    83.,    72.,    63.,    61.,    59.,    57.,
          56.,    55.,    54.,    51.,    43.,    42.,    41.,    40.,
          30.,    25.,   881.,   842.,   257.,    49.,    37.,    32.,
          29.,  7500.,  2048.,  1704.,  1475.,  1084.,   965.,   820.,
         805.,   762.,   740.,   567.,   553.,   514.,   418.,   371.,
         346.,   314.,   199.,    48.])

In [14]:
df5 = df3.copy()
df5['price_per_m2'] = df5['price_eur'] / df5['Area']
df5.head()

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating,price_per_m2
1,1007500.0,El Kantaoui,1000.0,16.0,14.0,30-50,1.0,108.792932,1,1,0,1,1007.500000
5,310000.0,Sousse Riadh,1000.0,16.0,9.0,1-5,2.0,119.603211,1,0,0,0,310.000000
10,620000.0,Kélibia,462.0,12.0,13.0,1-5,2.0,14.249053,0,1,0,1,1341.991342
11,372000.0,Bou Mhel,510.0,14.0,4.0,5-10,1.0,30.815266,1,0,1,1,729.411765
16,294500.0,El Gourjani,538.0,16.0,5.0,30-50,1.0,2.191132,0,0,0,0,547.397770

In [15]:
len(df5.location.unique())

316

In [16]:
df5.location = df5.location.apply(lambda x: x.strip())
location_stats = df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats

location
Hammamet                138
Hammamet Nord           115
La Soukra               113
Cité Ennasr 2           113
Djerba                  103
                       ...
Cité El Behi Ladghem      1
M'saken                   1
Maakel Ezzaim             1
Cité El Baccouch          1
Abou El Kacem Chebbi      1
Name: location, Length: 316, dtype: int64